-- phpMyAdmin SQL Dump
-- version 4.5.2
-- http://www.phpmyadmin.net
--
-- 主機: localhost
-- 產生時間： 2020 年 07 月 27 日 04:03
-- 伺服器版本: 10.1.19-MariaDB
-- PHP 版本： 5.6.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `BookDb2`
--

-- --------------------------------------------------------

--
-- 資料表結構 `BookList`
--

CREATE TABLE `BookList` (
  `id` int(3) NOT NULL,
  `ISBN` varchar(13) NOT NULL,
  `Comp` varchar(20) NOT NULL,
  `Book` varchar(50) NOT NULL,
  `Author` varchar(20) NOT NULL,
  `Price` int(20) NOT NULL,
  `Date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `BookList`
--

INSERT INTO `BookList` (`id`, `ISBN`, `Comp`, `Book`, `Author`, `Price`, `Date`) VALUES
(16, '684-887-621-1', '測試', '我是測試12', '施強頻', 605, '2005-10-21'),
(19, '957-442-217-8', '標期123', '測試', '施強頻', 408, '2001-07-04'),
(21, '957-442-217-8', '測試測試', '防火強頻寬管理連線管制3', '王大', 595, '2002-11-27'),
(22, '684-887-621-1', '先鋒2', '防火強頻寬管理''連線''管制1', '''王大砲''1', 598, '2004-07-08'),
(25, '684-887-621-1', '測試', '我是測試', '作者"作"者', 599, '2005-11-17'),
(27, '517-985-631-9', 'abc"出版社出"', '我是''一本書''', '作者', 999, '1994-09-15'),
(30, '957-442-217-8', '測試測試', '我是測試', '作者作"者', 560, '1998-07-08'),
(32, '684-887-621-1', '測試測試', '防火強頻寬管理連線管制3', '王大砲11', 596, '1999-07-02'),
(35, '684-887-621-1', '測試測試', '防火強頻寬管理連線管制2', '王大砲''', 400, '1993-04-28'),
(38, '123-456-789-0', '測試測試', '我是測試', '作者作', 415, '2003-07-02'),
(39, '987-654-321-0', '先鋒2"', '防火強頻寬管理連線管制3', '施強頻', 590, '2006-10-01'),
(40, '684-887-621-1', '測試測試', '我是''測試''', '我是"作者"', 408, '1989-10-24'),
(44, '684-887-621-1', '先鋒2"', '頻寬管理連線管制1', '施強頻', 595, '1997-10-16'),
(45, '684-887-621-1', '測試測試', '防火強頻寬管理連線管制1', '施強頻', 365, '2007-06-19'),
(47, '957-442-217-8', '測試"', '測試', '作者作者', 590, '2019-07-19'),
(48, '684-887-621-1', '測試', '防火強頻寬管理連線管制3', '施強頻', 400, '2020-12-24'),
(49, '957-442-217-8', '測試測試', '防火強頻寬管理連線管制1', '我是作者', 400, '2020-07-11'),
(50, '987-654-321-0', '標期', '防火強頻寬管理連線管制3', '作者作"者', 590, '2020-07-23'),
(51, '957-442-217-8', '測試測試', '防火強頻寬管理連線管制1', '我是作者', 591, '1998-07-15'),
(52, '987-654-321-0', '測試', '我是測試', '我是作者', 400, '2005-10-21'),
(53, '123-456-789-0', '測試', '我是測試', '我是作者', 400, '2006-08-10'),
(54, '987-654-321-0', '測試', '我是測試', '我是作者', 400, '2006-10-01'),
(55, '123-456-789-0', '測試', '我是測試', '我是作者', 400, '2005-10-21'),
(56, '987-654-321-0', '測試', '我是測試', '我是作者', 400, '2005-10-12'),
(57, '987-654-321-0', '測試測試', '我是測試', '我是作者', 400, '2006-08-10'),
(58, '957-442-217-8', '測試"', '我是測試', '我是作者', 400, '2005-10-21'),
(59, '987-654-321-0', '測試', '我是測試', '我是作者', 410, '2006-10-01'),
(60, '987-654-321-0', '測試', '我是測試', '我是作者', 416, '2005-10-21'),
(61, '987-654-321-0', '測試測試', '測試', '作者作者', 595, '2005-10-21'),
(62, '123-456-789-0', '測試', '我是測試', '我是作者', 590, '2005-10-21'),
(63, '684-887-621-1', '測試測試', '我是測試', '我是作者', 412, '2005-10-21'),
(64, '684-887-621-1', '測試測試', '我是測試', '我是作者', 400, '2005-10-21'),
(65, '684-887-621-1', '先鋒2"', '防火強頻寬管理連線管制3', '施強頻', 590, '2006-08-10'),
(66, '684-887-621-1', '測試測試', '我是測試', '作者作者', 400, '2020-07-10'),
(67, '596-847-820-4', '旗標', '防火強頻寬管理連線管制3', '王大砲', 590, '2000-09-26'),
(72, '684-887-621-1', '旗標', '測試', '王大砲', 683, '1992-08-21'),
(74, '547-896-512-6', '旗標', '我是一本書', '施強頻', 845, '1993-09-11'),
(76, '987-654-321-0', '測試', '我是測試', '我是作者', 595, '2005-11-15'),
(77, '957-442-217-8', '旗標', '防火強頻寬管理連線管制1', '王大砲''', 595, '2000-10-31'),
(78, '684-887-621-1', '標期', '防火強頻寬管理連線管制3', '施強頻', 400, '2020-07-10'),
(79, '684-887-621-1', '測試測試', '我是測試"測試''', '我是作者', 595, '2006-08-10');

-- --------------------------------------------------------

--
-- 資料表結構 `Company`
--

CREATE TABLE `Company` (
  `id` int(3) NOT NULL,
  `Name` varchar(20) NOT NULL,
  `Phone` varchar(11) NOT NULL,
  `Address` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `Company`
--

INSERT INTO `Company` (`id`, `Name`, `Phone`, `Address`) VALUES
(1, '旗標', '04-27050888', '台中市西屯區西屯路二段256巷6號3樓之6'),
(2, '測試', '04-84961234', '台中市西屯區測試路三段123號'),
(3, '測試測試', '04-91535748', '台中市北屯區測試測試路一段333號');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `BookList`
--
ALTER TABLE `BookList`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `Company`
--
ALTER TABLE `Company`
  ADD PRIMARY KEY (`id`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `BookList`
--
ALTER TABLE `BookList`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=80;
--
-- 使用資料表 AUTO_INCREMENT `Company`
--
ALTER TABLE `Company`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
